'''. მოცემული 3 მთელი a,b,c= 0 რიცხვებისთვის მოძებნეთ a და
b რიცხვებსშორისმოხვედრილი c რიცხვის ჯერადი რიცხვების
რაოდენობა ყველა შესაძლო ვარიანტისთვის. თუ რომელიმე
a, b-დან ჯერადია c-ს, მაშინ ჩათვალეთ შესაბამისი საზღვარი.
მოიფიქრეთამოცანის ამოხსნის ალგორითმი, დაწერეთ და გაუშვით
პროგრამა ციკლის და რეკურსიის (აგრეთვე range) კონსტრუქციის გამოყენების გარეშე.'''


def find_number(a, b, c):
    count = 0
    for num in range(a, b+1):
        if num % c == 0:
            count += 1
    return count
print(find_number(1, 30, 5))

